#-----------------------------------------------------------------------------------------------------------------------------------------
# importation des bibliothèques nécessaires
#-----------------------------------------------------------------------------------------------------------------------------------------
import pandas as pd

#-----------------------------------------------------------------------------------------------------------------------------------------
# Chargement des données 
#-----------------------------------------------------------------------------------------------------------------------------------------
data_logement = "Donnees-detaillees-au-logement-du-repertoire-des-logements-locatifs-des-bailleurs-sociau.2025-01.csv"
#df_logement = pd.read_csv(data_logement,sep=";", encoding="latin-1")

df_logement = pd.read_csv(
    data_logement,
    sep=";",
)


#-----------------------------------------------------------------------------------------------------------------------------------------
#   nettoyage
#-----------------------------------------------------------------------------------------------------------------------------------------
df_logement_test = df_logement[df_logement["Libéllé EPCI"] == "Métropole Européenne de Lille"]
df_logement_test.to_csv("logements-locatifs-des-bailleurs-sociau.csv", index=False)

